{
    "title": "Neologism generator",
    "nWords": "Number of words",
    "lang": "Language",
    "lang_select": "select an option",
    "lang_ar": "Arabic",
    "lang_de": "German",
    "lang_en": "English",
    "lang_el": "Greek",
    "lang_eo": "Esperanto",
    "lang_es": "Spanish",
    "lang_fr": "French",
    "lang_he": "Hebrew",
    "lang_hrsr_cy": "Serbo-Croatian (Cyrillic)",
    "lang_hrsr_la": "Serbo-Croatian (Latin)",
    "lang_it": "Italian",
    "lang_nl": "Dutch",
    "lang_no": "Norwegian",
    "lang_pl": "Polish",
    "lang_pt_br": "Portuguese (BR)",
    "lang_pt_pt": "Portuguese (PT)",
    "lang_ro": "Romanian",
    "lang_ru": "Russian",
    "lang_sq": "Albanian",
    "lang_uk": "Ukrainian",
    "trieDepth": "Trie Depth",
    "minWordLen": "Minimum length of word",
    "send": "Send",
    "what_is_this": "What is this",
    "p01": "This is a neologism generator. A <a href='https://en.wikipedia.org/wiki/Neologism'>neologism</a> is a freshly coined word. Although some creativity is involved in the creation of new words, as we properly credit the geniuses of Shakespeare, Joyce and Guimarães Rosa, neologisms follow phonological and morphological patterns which can be replicated by a mechanical process.",
    "p02": "Starting from frequency words from natural languages, obtained from <a href='https://invokeit.wordpress.com/frequency-word-lists/'>this blog</a> referred by Wikipedia, we produce new words, that follow their patterns as a <a href='https://en.wikipedia.org/wiki/Markov_chain'>Markov (anamnesic) process</a>.",
    "p03": "For example, the i<sup>th</sup> letter in a word depends solely one the last N letters defined by the parameter \"Trie-Depth\". If you use a too low \"Trie-Depth\", you will end up with almost random words, as the next letter only depends on the last one or two. When the parameter goes up, we get words that look somewhat funny, but could eventually be found in the language, even if as a pun. With a high Trie-Depth, the words are probably proper words of the language, but were not in the original list because they were too specific (too many derivational affixes and so on).",
    "p04": "The backend was implemented with C, with my own implementation of the Trie data structure. As demonstrated in <a href='/node-vs-c'>another article</a> published by me, compiled and optimized C code can be at least 5 times faster than native NodeJS. This makes it quite fast to process frequency lists. Most of the work is actually done trying to find a word which follows the given Markov process, but is not in the original list. Anyway, even in the worst reasonable scenarios, the server usually responds with only 100 MB RAM usage and 4 seconds delay.",
    "p05": "The web-backend is implemented with NodeJS, with the library teen_process to call C code as an external process.",
    "p06": "<a href='https://github.com/moraesvic/neologism-generator'>Check the project source at GitHub!</a>",
    "alertSelectLanguage": "Please select one language."
}